"{\"class_name\": \"Tokenizer\", \"config\": {\"num_words\": 800, \"filters\": \"!\\\"#$%&()*+,-./:;<=>?@[\\\\]^_`{|}~\\t\\n\", \"lower\": true, \"split\": \" \", \"char_level\": false, \"oov_token\": null, \"document_count\": 54, \"word_counts\": \"{\\\"given\\\": 47, \\\"an\\\": 45, \\\"array\\\": 34, \\\"nums\\\": 31, \\\"of\\\": 85, \\\"size\\\": 3, \\\"n\\\": 23, \\\"return\\\": 52, \\\"the\\\": 164, \\\"majority\\\": 3, \\\"element\\\": 12, \\\"is\\\": 49, \\\"that\\\": 33, \\\"appears\\\": 2, \\\"more\\\": 2, \\\"than\\\": 4, \\\"\\\\u230an\\\": 1, \\\"2\\\\u230b\\\": 1, \\\"times\\\": 1, \\\"you\\\": 37, \\\"may\\\": 9, \\\"assume\\\": 6, \\\"always\\\": 2, \\\"exists\\\": 3, \\\"in\\\": 42, \\\"k\\\": 12, \\\"are\\\": 17, \\\"x\\\": 7, \\\"2d\\\": 5, \\\"matrix\\\": 5, \\\"representing\\\": 6, \\\"image\\\": 3, \\\"rotate\\\": 2, \\\"by\\\": 12, \\\"90\\\": 1, \\\"degree\\\": 1, \\\"clockwise\\\": 2, \\\"have\\\": 5, \\\"to\\\": 31, \\\"place\\\": 3, \\\"which\\\": 3, \\\"mean\\\": 1, \\\"modify\\\": 1, \\\"input\\\": 5, \\\"directly\\\": 1, \\\"do\\\": 5, \\\"not\\\": 11, \\\"allocate\\\": 1, \\\"another\\\": 1, \\\"and\\\": 56, \\\"rotation\\\": 2, \\\"root\\\": 4, \\\"a\\\": 66, \\\"binary\\\": 7, \\\"search\\\": 2, \\\"tree\\\": 5, \\\"integer\\\": 26, \\\"kth\\\": 2, \\\"smallest\\\": 3, \\\"value\\\": 5, \\\"1\\\": 28, \\\"indexed\\\": 4, \\\"all\\\": 19, \\\"node\\\": 15, \\\"with\\\": 11, \\\"object\\\": 2, \\\"colored\\\": 1, \\\"red\\\": 3, \\\"white\\\": 3, \\\"or\\\": 17, \\\"blue\\\": 3, \\\"sort\\\": 2, \\\"them\\\": 2, \\\"so\\\": 4, \\\"same\\\": 6, \\\"color\\\": 3, \\\"adjacent\\\": 5, \\\"order\\\": 9, \\\"we\\\": 1, \\\"will\\\": 3, \\\"use\\\": 1, \\\"0\\\": 11, \\\"2\\\": 6, \\\"represent\\\": 2, \\\"respectively\\\": 4, \\\"must\\\": 6, \\\"solve\\\": 4, \\\"this\\\": 3, \\\"problem\\\": 4, \\\"without\\\": 6, \\\"using\\\": 5, \\\"library's\\\": 1, \\\"function\\\": 7, \\\"every\\\": 6, \\\"si\\\": 2, \\\"for\\\": 3, \\\"i\\\": 12, \\\"wordlist\\\": 7, \\\"note\\\": 6, \\\"begigiven\\\": 2, \\\"string\\\": 19, \\\"s\\\": 17, \\\"partition\\\": 4, \\\"such\\\": 9, \\\"substring\\\": 6, \\\"palindrome\\\": 6, \\\"possible\\\": 6, \\\"partitioning\\\": 2, \\\"nword\\\": 2, \\\"doe\\\": 4, \\\"need\\\": 3, \\\"be\\\": 9, \\\"linked\\\": 14, \\\"lists\\\": 6, \\\"each\\\": 12, \\\"list\\\": 12, \\\"sorted\\\": 9, \\\"ascending\\\": 3, \\\"merge\\\": 2, \\\"into\\\": 5, \\\"one\\\": 5, \\\"it\\\": 21, \\\"professional\\\": 1, \\\"robber\\\": 1, \\\"planning\\\": 1, \\\"rob\\\": 2, \\\"house\\\": 5, \\\"along\\\": 3, \\\"street\\\": 1, \\\"ha\\\": 2, \\\"certain\\\": 1, \\\"amount\\\": 8, \\\"money\\\": 5, \\\"stashed\\\": 1, \\\"only\\\": 4, \\\"constraint\\\": 1, \\\"stopping\\\": 1, \\\"from\\\": 8, \\\"robbing\\\": 1, \\\"security\\\": 1, \\\"system\\\": 1, \\\"connected\\\": 1, \\\"automatically\\\": 1, \\\"contact\\\": 1, \\\"police\\\": 2, \\\"if\\\": 20, \\\"two\\\": 19, \\\"were\\\": 1, \\\"broken\\\": 1, \\\"on\\\": 9, \\\"night\\\": 1, \\\"maximum\\\": 5, \\\"can\\\": 9, \\\"tonight\\\": 1, \\\"alerting\\\": 1, \\\"nums1\\\": 2, \\\"nums2\\\": 2, \\\"m\\\": 9, \\\"median\\\": 2, \\\"arrays\\\": 2, \\\"unsorted\\\": 2, \\\"missing\\\": 1, \\\"positive\\\": 1, \\\"length\\\": 7, \\\"longest\\\": 7, \\\"consecutive\\\": 1, \\\"sequence\\\": 8, \\\"containing\\\": 2, \\\"digit\\\": 6, \\\"9\\\": 1, \\\"inclusive\\\": 2, \\\"letter\\\": 7, \\\"combination\\\": 3, \\\"number\\\": 19, \\\"could\\\": 1, \\\"answer\\\": 4, \\\"any\\\": 9, \\\"mapping\\\": 1, \\\"just\\\": 1, \\\"like\\\": 1, \\\"telephone\\\": 1, \\\"buttons\\\": 1, \\\"below\\\": 1, \\\"map\\\": 3, \\\"letters\\\": 1, \\\"true\\\": 5, \\\"at\\\": 9, \\\"least\\\": 1, \\\"twice\\\": 1, \\\"false\\\": 4, \\\"distinct\\\": 3, \\\"write\\\": 6, \\\"find\\\": 7, \\\"common\\\": 4, \\\"prefix\\\": 5, \\\"amongst\\\": 2, \\\"strings\\\": 2, \\\"there\\\": 7, \\\"no\\\": 4, \\\"empty\\\": 6, \\\"phrase\\\": 3, \\\"after\\\": 2, \\\"converting\\\": 1, \\\"uppercase\\\": 1, \\\"lowercase\\\": 1, \\\"removing\\\": 1, \\\"non\\\": 6, \\\"alphanumeric\\\": 2, \\\"characters\\\": 3, \\\"read\\\": 1, \\\"forward\\\": 1, \\\"backward\\\": 1, \\\"character\\\": 4, \\\"include\\\": 1, \\\"numbers\\\": 1, \\\"otherwise\\\": 4, \\\"head\\\": 2, \\\"singly\\\": 2, \\\"group\\\": 4, \\\"odd\\\": 6, \\\"index\\\": 12, \\\"together\\\": 2, \\\"followed\\\": 2, \\\"even\\\": 6, \\\"indices\\\": 2, \\\"reordered\\\": 2, \\\"first\\\": 5, \\\"considered\\\": 3, \\\"second\\\": 2, \\\"relative\\\": 2, \\\"inside\\\": 2, \\\"both\\\": 2, \\\"should\\\": 2, \\\"remain\\\": 2, \\\"wa\\\": 2, \\\"o\\\": 6, \\\"extra\\\": 4, \\\"space\\\": 4, \\\"complexity\\\": 4, \\\"time\\\": 6, \\\"grid\\\": 9, \\\"represents\\\": 5, \\\"'1's\\\": 2, \\\"land\\\": 4, \\\"'0's\\\": 2, \\\"water\\\": 6, \\\"islands\\\": 2, \\\"island\\\": 2, \\\"surrounded\\\": 4, \\\"formed\\\": 4, \\\"connecting\\\": 2, \\\"horizontally\\\": 2, \\\"vertically\\\": 2, \\\"four\\\": 3, \\\"edge\\\": 2, \\\"point\\\": 7, \\\"where\\\": 4, \\\"points\\\": 2, \\\"xi\\\": 2, \\\"yi\\\": 2, \\\"y\\\": 2, \\\"plane\\\": 2, \\\"lie\\\": 2, \\\"straight\\\": 2, \\\"line\\\": 2, \\\"repeating\\\": 3, \\\"exist\\\": 1, \\\"values\\\": 2, \\\"prior\\\": 1, \\\"being\\\": 1, \\\"passed\\\": 1, \\\"your\\\": 2, \\\"possibly\\\": 1, \\\"rotated\\\": 2, \\\"unknown\\\": 1, \\\"pivot\\\": 2, \\\"resulting\\\": 1, \\\"example\\\": 1, \\\"4\\\": 2, \\\"5\\\": 2, \\\"6\\\": 2, \\\"7\\\": 2, \\\"might\\\": 1, \\\"3\\\": 1, \\\"become\\\": 1, \\\"target\\\": 2, \\\"unique\\\": 3, \\\"elements\\\": 1, \\\"subset\\\": 1, \\\"power\\\": 1, \\\"set\\\": 1, \\\"sk\\\": 3, \\\"endwordthere\\\": 1, \\\"gas\\\": 8, \\\"station\\\": 4, \\\"circular\\\": 1, \\\"route\\\": 1, \\\"ith\\\": 2, \\\"car\\\": 1, \\\"unlimited\\\": 1, \\\"tank\\\": 2, \\\"cost\\\": 3, \\\"travel\\\": 2, \\\"next\\\": 1, \\\"th\\\": 1, \\\"begin\\\": 1, \\\"journey\\\": 1, \\\"stations\\\": 1, \\\"starting\\\": 1, \\\"station's\\\": 1, \\\"around\\\": 2, \\\"circuit\\\": 1, \\\"once\\\": 2, \\\"direction\\\": 1, \\\"solution\\\": 1, \\\"guaranteed\\\": 2, \\\"t\\\": 4, \\\"minimum\\\": 1, \\\"window\\\": 2, \\\"including\\\": 1, \\\"duplicates\\\": 1, \\\"included\\\": 1, \\\"peak\\\": 2, \\\"strictly\\\": 2, \\\"greater\\\": 2, \\\"neighbors\\\": 1, \\\"contains\\\": 3, \\\"multiple\\\": 2, \\\"peaks\\\": 2, \\\"imagine\\\": 1, \\\"\\\\u221e\\\": 1, \\\"other\\\": 1, \\\"words\\\": 3, \\\"neighbor\\\": 1, \\\"outside\\\": 2, \\\"climbing\\\": 1, \\\"staircase\\\": 1, \\\"take\\\": 3, \\\"step\\\": 1, \\\"reach\\\": 3, \\\"top\\\": 3, \\\"either\\\": 3, \\\"climb\\\": 2, \\\"steps\\\": 1, \\\"how\\\": 1, \\\"many\\\": 1, \\\"way\\\": 1, \\\"anagram\\\": 2, \\\"word\\\": 10, \\\"rearranging\\\": 1, \\\"different\\\": 2, \\\"typically\\\": 1, \\\"original\\\": 1, \\\"exactly\\\": 1, \\\"coin\\\": 4, \\\"denomination\\\": 1, \\\"total\\\": 1, \\\"fewest\\\": 1, \\\"make\\\": 1, \\\"up\\\": 3, \\\"cannot\\\": 1, \\\"made\\\": 1, \\\"coins\\\": 1, \\\"infinite\\\": 1, \\\"kind\\\": 1, \\\"pair\\\": 1, \\\"parentheses\\\": 1, \\\"generate\\\": 1, \\\"well\\\": 1, \\\"parenthesis\\\": 1, \\\"tree's\\\": 1, \\\"depth\\\": 1, \\\"path\\\": 3, \\\"down\\\": 3, \\\"farthest\\\": 1, \\\"leaf\\\": 1, \\\"revers\\\": 1, \\\"modifying\\\": 2, \\\"memory\\\": 1, \\\"range\\\": 1, \\\"repeated\\\": 2, \\\"us\\\": 1, \\\"constant\\\": 1, \\\"transformation\\\": 3, \\\"beginword\\\": 6, \\\"endword\\\": 4, \\\"dictionary\\\": 6, \\\"s1\\\": 2, \\\"s2\\\": 2, \\\"inorder\\\": 1, \\\"traversal\\\": 1, \\\"nodes'\\\": 1, \\\"worddict\\\": 1, \\\"segmented\\\": 1, \\\"separated\\\": 1, \\\"reused\\\": 1, \\\"segmentation\\\": 1, \\\"shortest\\\": 1, \\\"increasing\\\": 1, \\\"cell\\\": 1, \\\"move\\\": 5, \\\"directions\\\": 1, \\\"left\\\": 2, \\\"right\\\": 4, \\\"diagonally\\\": 1, \\\"boundary\\\": 1, \\\"e\\\": 3, \\\"wrap\\\": 1, \\\"allowed\\\": 1, \\\"negative\\\": 2, \\\"integers\\\": 2, \\\"stored\\\": 2, \\\"reverse\\\": 3, \\\"their\\\": 2, \\\"single\\\": 2, \\\"add\\\": 2, \\\"sum\\\": 4, \\\"contain\\\": 2, \\\"leading\\\": 2, \\\"zero\\\": 2, \\\"except\\\": 3, \\\"itself\\\": 2, \\\"representation\\\": 1, \\\"unsigned\\\": 2, \\\"'1'\\\": 1, \\\"bit\\\": 4, \\\"also\\\": 1, \\\"known\\\": 1, \\\"hamming\\\": 1, \\\"weight\\\": 1, \\\"initially\\\": 2, \\\"positioned\\\": 1, \\\"array's\\\": 1, \\\"jump\\\": 1, \\\"position\\\": 1, \\\"last\\\": 1, \\\"robot\\\": 5, \\\"located\\\": 1, \\\"corner\\\": 3, \\\"try\\\": 1, \\\"bottom\\\": 2, \\\"test\\\": 1, \\\"case\\\": 1, \\\"generated\\\": 1, \\\"le\\\": 1, \\\"equal\\\": 2, \\\"109\\\": 1, \\\"subarray\\\": 1, \\\"largest\\\": 1, \\\"product\\\": 2, \\\"suffix\\\": 1, \\\"fit\\\": 1, \\\"32\\\": 2, \\\"algorithm\\\": 1, \\\"run\\\": 1, \\\"division\\\": 1, \\\"operation\\\": 1, \\\"needle\\\": 3, \\\"haystack\\\": 3, \\\"occurrence\\\": 1, \\\"part\\\": 1}\", \"word_docs\": \"{\\\"the\\\": 50, \\\"than\\\": 3, \\\"more\\\": 2, \\\"always\\\": 2, \\\"may\\\": 9, \\\"is\\\": 29, \\\"that\\\": 22, \\\"you\\\": 21, \\\"given\\\": 45, \\\"appears\\\": 2, \\\"element\\\": 6, \\\"majority\\\": 1, \\\"exists\\\": 3, \\\"in\\\": 29, \\\"\\\\u230an\\\": 1, \\\"size\\\": 3, \\\"nums\\\": 13, \\\"n\\\": 19, \\\"2\\\\u230b\\\": 1, \\\"assume\\\": 6, \\\"array\\\": 24, \\\"return\\\": 44, \\\"an\\\": 31, \\\"times\\\": 1, \\\"of\\\": 46, \\\"x\\\": 7, \\\"representing\\\": 5, \\\"90\\\": 1, \\\"2d\\\": 3, \\\"by\\\": 8, \\\"mean\\\": 1, \\\"degree\\\": 1, \\\"directly\\\": 1, \\\"allocate\\\": 1, \\\"rotation\\\": 2, \\\"image\\\": 1, \\\"not\\\": 10, \\\"input\\\": 4, \\\"k\\\": 8, \\\"are\\\": 14, \\\"another\\\": 1, \\\"and\\\": 32, \\\"rotate\\\": 1, \\\"have\\\": 4, \\\"to\\\": 20, \\\"clockwise\\\": 2, \\\"which\\\": 3, \\\"modify\\\": 1, \\\"place\\\": 3, \\\"matrix\\\": 2, \\\"do\\\": 4, \\\"1\\\": 18, \\\"all\\\": 16, \\\"root\\\": 4, \\\"smallest\\\": 3, \\\"search\\\": 2, \\\"integer\\\": 20, \\\"value\\\": 3, \\\"node\\\": 7, \\\"indexed\\\": 4, \\\"a\\\": 36, \\\"kth\\\": 2, \\\"tree\\\": 3, \\\"binary\\\": 7, \\\"0\\\": 7, \\\"or\\\": 13, \\\"solve\\\": 4, \\\"adjacent\\\": 4, \\\"respectively\\\": 4, \\\"using\\\": 5, \\\"without\\\": 6, \\\"2\\\": 5, \\\"must\\\": 6, \\\"with\\\": 7, \\\"will\\\": 3, \\\"same\\\": 6, \\\"use\\\": 1, \\\"colored\\\": 1, \\\"so\\\": 4, \\\"problem\\\": 4, \\\"function\\\": 7, \\\"object\\\": 1, \\\"color\\\": 1, \\\"we\\\": 1, \\\"sort\\\": 1, \\\"order\\\": 9, \\\"them\\\": 2, \\\"white\\\": 1, \\\"library's\\\": 1, \\\"represent\\\": 2, \\\"red\\\": 1, \\\"blue\\\": 1, \\\"this\\\": 3, \\\"begigiven\\\": 2, \\\"every\\\": 4, \\\"wordlist\\\": 5, \\\"partition\\\": 2, \\\"substring\\\": 5, \\\"possible\\\": 6, \\\"si\\\": 2, \\\"nword\\\": 2, \\\"partitioning\\\": 2, \\\"for\\\": 3, \\\"doe\\\": 4, \\\"be\\\": 8, \\\"need\\\": 3, \\\"such\\\": 8, \\\"i\\\": 8, \\\"note\\\": 6, \\\"palindrome\\\": 3, \\\"s\\\": 10, \\\"string\\\": 14, \\\"linked\\\": 6, \\\"sorted\\\": 5, \\\"lists\\\": 2, \\\"merge\\\": 2, \\\"each\\\": 10, \\\"list\\\": 6, \\\"ascending\\\": 3, \\\"into\\\": 5, \\\"it\\\": 14, \\\"one\\\": 5, \\\"robbing\\\": 1, \\\"only\\\": 3, \\\"connected\\\": 1, \\\"security\\\": 1, \\\"night\\\": 1, \\\"planning\\\": 1, \\\"maximum\\\": 5, \\\"can\\\": 7, \\\"stashed\\\": 1, \\\"if\\\": 15, \\\"professional\\\": 1, \\\"broken\\\": 1, \\\"certain\\\": 1, \\\"robber\\\": 1, \\\"ha\\\": 2, \\\"along\\\": 3, \\\"on\\\": 7, \\\"contact\\\": 1, \\\"rob\\\": 1, \\\"system\\\": 1, \\\"automatically\\\": 1, \\\"constraint\\\": 1, \\\"from\\\": 8, \\\"street\\\": 1, \\\"stopping\\\": 1, \\\"tonight\\\": 1, \\\"police\\\": 1, \\\"money\\\": 2, \\\"house\\\": 1, \\\"alerting\\\": 1, \\\"were\\\": 1, \\\"amount\\\": 3, \\\"two\\\": 11, \\\"nums2\\\": 2, \\\"arrays\\\": 2, \\\"median\\\": 2, \\\"m\\\": 7, \\\"nums1\\\": 2, \\\"missing\\\": 1, \\\"unsorted\\\": 2, \\\"positive\\\": 1, \\\"length\\\": 7, \\\"longest\\\": 7, \\\"sequence\\\": 4, \\\"consecutive\\\": 1, \\\"inclusive\\\": 2, \\\"letter\\\": 3, \\\"digit\\\": 3, \\\"answer\\\": 3, \\\"letters\\\": 1, \\\"number\\\": 13, \\\"telephone\\\": 1, \\\"combination\\\": 3, \\\"mapping\\\": 1, \\\"map\\\": 3, \\\"any\\\": 8, \\\"just\\\": 1, \\\"could\\\": 1, \\\"below\\\": 1, \\\"buttons\\\": 1, \\\"like\\\": 1, \\\"9\\\": 1, \\\"containing\\\": 2, \\\"distinct\\\": 3, \\\"twice\\\": 1, \\\"at\\\": 5, \\\"true\\\": 5, \\\"false\\\": 4, \\\"least\\\": 1, \\\"empty\\\": 6, \\\"prefix\\\": 3, \\\"amongst\\\": 2, \\\"no\\\": 4, \\\"common\\\": 2, \\\"find\\\": 7, \\\"strings\\\": 2, \\\"there\\\": 7, \\\"write\\\": 6, \\\"characters\\\": 3, \\\"after\\\": 2, \\\"forward\\\": 1, \\\"non\\\": 4, \\\"numbers\\\": 1, \\\"backward\\\": 1, \\\"converting\\\": 1, \\\"uppercase\\\": 1, \\\"lowercase\\\": 1, \\\"alphanumeric\\\": 1, \\\"include\\\": 1, \\\"otherwise\\\": 4, \\\"character\\\": 4, \\\"read\\\": 1, \\\"removing\\\": 1, \\\"phrase\\\": 2, \\\"should\\\": 2, \\\"index\\\": 8, \\\"head\\\": 2, \\\"complexity\\\": 2, \\\"both\\\": 2, \\\"considered\\\": 3, \\\"inside\\\": 2, \\\"followed\\\": 2, \\\"o\\\": 4, \\\"second\\\": 2, \\\"remain\\\": 2, \\\"indices\\\": 2, \\\"reordered\\\": 2, \\\"wa\\\": 2, \\\"odd\\\": 2, \\\"time\\\": 6, \\\"first\\\": 5, \\\"extra\\\": 4, \\\"relative\\\": 2, \\\"space\\\": 4, \\\"singly\\\": 2, \\\"group\\\": 2, \\\"together\\\": 2, \\\"even\\\": 2, \\\"'1's\\\": 2, \\\"water\\\": 2, \\\"islands\\\": 2, \\\"surrounded\\\": 2, \\\"represents\\\": 5, \\\"island\\\": 2, \\\"connecting\\\": 2, \\\"grid\\\": 3, \\\"formed\\\": 4, \\\"vertically\\\": 2, \\\"land\\\": 2, \\\"edge\\\": 2, \\\"horizontally\\\": 2, \\\"'0's\\\": 2, \\\"four\\\": 3, \\\"xi\\\": 2, \\\"lie\\\": 2, \\\"y\\\": 2, \\\"straight\\\": 2, \\\"point\\\": 3, \\\"points\\\": 2, \\\"where\\\": 4, \\\"yi\\\": 2, \\\"plane\\\": 2, \\\"line\\\": 2, \\\"repeating\\\": 3, \\\"exist\\\": 1, \\\"7\\\": 1, \\\"possibly\\\": 1, \\\"resulting\\\": 1, \\\"6\\\": 1, \\\"example\\\": 1, \\\"your\\\": 2, \\\"3\\\": 1, \\\"prior\\\": 1, \\\"unknown\\\": 1, \\\"become\\\": 1, \\\"rotated\\\": 1, \\\"4\\\": 1, \\\"might\\\": 1, \\\"5\\\": 1, \\\"values\\\": 2, \\\"passed\\\": 1, \\\"target\\\": 1, \\\"pivot\\\": 1, \\\"being\\\": 1, \\\"unique\\\": 3, \\\"set\\\": 1, \\\"elements\\\": 1, \\\"subset\\\": 1, \\\"power\\\": 1, \\\"once\\\": 2, \\\"around\\\": 2, \\\"guaranteed\\\": 2, \\\"route\\\": 1, \\\"begin\\\": 1, \\\"travel\\\": 1, \\\"th\\\": 1, \\\"car\\\": 1, \\\"gas\\\": 1, \\\"unlimited\\\": 1, \\\"ith\\\": 1, \\\"direction\\\": 1, \\\"starting\\\": 1, \\\"stations\\\": 1, \\\"station\\\": 1, \\\"journey\\\": 1, \\\"next\\\": 1, \\\"solution\\\": 1, \\\"sk\\\": 3, \\\"tank\\\": 1, \\\"circular\\\": 1, \\\"cost\\\": 1, \\\"station's\\\": 1, \\\"circuit\\\": 1, \\\"endwordthere\\\": 1, \\\"window\\\": 1, \\\"including\\\": 1, \\\"minimum\\\": 1, \\\"duplicates\\\": 1, \\\"t\\\": 2, \\\"included\\\": 1, \\\"multiple\\\": 2, \\\"outside\\\": 2, \\\"other\\\": 1, \\\"imagine\\\": 1, \\\"words\\\": 2, \\\"contains\\\": 3, \\\"neighbors\\\": 1, \\\"peaks\\\": 1, \\\"peak\\\": 1, \\\"strictly\\\": 1, \\\"\\\\u221e\\\": 1, \\\"neighbor\\\": 1, \\\"greater\\\": 1, \\\"reach\\\": 3, \\\"take\\\": 3, \\\"climbing\\\": 1, \\\"way\\\": 1, \\\"many\\\": 1, \\\"steps\\\": 1, \\\"staircase\\\": 1, \\\"step\\\": 1, \\\"climb\\\": 1, \\\"either\\\": 3, \\\"top\\\": 2, \\\"how\\\": 1, \\\"word\\\": 4, \\\"exactly\\\": 1, \\\"original\\\": 1, \\\"rearranging\\\": 1, \\\"different\\\": 2, \\\"anagram\\\": 1, \\\"typically\\\": 1, \\\"cannot\\\": 1, \\\"coin\\\": 1, \\\"denomination\\\": 1, \\\"fewest\\\": 1, \\\"total\\\": 1, \\\"coins\\\": 1, \\\"kind\\\": 1, \\\"made\\\": 1, \\\"infinite\\\": 1, \\\"make\\\": 1, \\\"up\\\": 2, \\\"pair\\\": 1, \\\"parentheses\\\": 1, \\\"well\\\": 1, \\\"parenthesis\\\": 1, \\\"generate\\\": 1, \\\"tree's\\\": 1, \\\"down\\\": 3, \\\"depth\\\": 1, \\\"path\\\": 3, \\\"leaf\\\": 1, \\\"farthest\\\": 1, \\\"memory\\\": 1, \\\"modifying\\\": 2, \\\"revers\\\": 1, \\\"range\\\": 1, \\\"us\\\": 1, \\\"constant\\\": 1, \\\"repeated\\\": 1, \\\"beginword\\\": 3, \\\"endword\\\": 3, \\\"s1\\\": 2, \\\"transformation\\\": 3, \\\"s2\\\": 2, \\\"dictionary\\\": 3, \\\"inorder\\\": 1, \\\"nodes'\\\": 1, \\\"traversal\\\": 1, \\\"worddict\\\": 1, \\\"separated\\\": 1, \\\"segmentation\\\": 1, \\\"shortest\\\": 1, \\\"reused\\\": 1, \\\"segmented\\\": 1, \\\"wrap\\\": 1, \\\"diagonally\\\": 1, \\\"e\\\": 2, \\\"move\\\": 2, \\\"directions\\\": 1, \\\"increasing\\\": 1, \\\"left\\\": 2, \\\"allowed\\\": 1, \\\"cell\\\": 1, \\\"right\\\": 2, \\\"boundary\\\": 1, \\\"negative\\\": 2, \\\"add\\\": 2, \\\"their\\\": 2, \\\"leading\\\": 2, \\\"integers\\\": 2, \\\"except\\\": 3, \\\"sum\\\": 3, \\\"reverse\\\": 3, \\\"contain\\\": 2, \\\"zero\\\": 2, \\\"stored\\\": 2, \\\"itself\\\": 2, \\\"single\\\": 2, \\\"known\\\": 1, \\\"representation\\\": 1, \\\"hamming\\\": 1, \\\"'1'\\\": 1, \\\"also\\\": 1, \\\"unsigned\\\": 2, \\\"bit\\\": 3, \\\"weight\\\": 1, \\\"position\\\": 1, \\\"jump\\\": 1, \\\"array's\\\": 1, \\\"last\\\": 1, \\\"initially\\\": 2, \\\"positioned\\\": 1, \\\"le\\\": 1, \\\"bottom\\\": 1, \\\"try\\\": 1, \\\"case\\\": 1, \\\"equal\\\": 2, \\\"located\\\": 1, \\\"generated\\\": 1, \\\"test\\\": 1, \\\"corner\\\": 1, \\\"109\\\": 1, \\\"robot\\\": 1, \\\"subarray\\\": 1, \\\"largest\\\": 1, \\\"algorithm\\\": 1, \\\"product\\\": 1, \\\"32\\\": 2, \\\"run\\\": 1, \\\"operation\\\": 1, \\\"division\\\": 1, \\\"suffix\\\": 1, \\\"fit\\\": 1, \\\"part\\\": 1, \\\"occurrence\\\": 1, \\\"haystack\\\": 1, \\\"needle\\\": 1}\", \"index_docs\": \"{\\\"1\\\": 50, \\\"108\\\": 3, \\\"184\\\": 2, \\\"185\\\": 2, \\\"40\\\": 9, \\\"6\\\": 29, \\\"12\\\": 22, \\\"10\\\": 21, \\\"7\\\": 45, \\\"183\\\": 2, \\\"29\\\": 6, \\\"140\\\": 1, \\\"141\\\": 3, \\\"9\\\": 29, \\\"289\\\": 1, \\\"139\\\": 3, \\\"13\\\": 13, \\\"17\\\": 19, \\\"290\\\": 1, \\\"65\\\": 6, \\\"11\\\": 24, \\\"5\\\": 44, \\\"8\\\": 31, \\\"291\\\": 1, \\\"2\\\": 46, \\\"55\\\": 7, \\\"66\\\": 5, \\\"292\\\": 1, \\\"88\\\": 3, \\\"31\\\": 8, \\\"294\\\": 1, \\\"293\\\": 1, \\\"296\\\": 1, \\\"297\\\": 1, \\\"188\\\": 2, \\\"142\\\": 1, \\\"36\\\": 10, \\\"91\\\": 4, \\\"30\\\": 8, \\\"24\\\": 14, \\\"298\\\": 1, \\\"4\\\": 32, \\\"186\\\": 1, \\\"90\\\": 4, \\\"14\\\": 20, \\\"187\\\": 2, \\\"144\\\": 3, \\\"295\\\": 1, \\\"143\\\": 3, \\\"89\\\": 2, \\\"92\\\": 4, \\\"15\\\": 18, \\\"20\\\": 16, \\\"109\\\": 4, \\\"145\\\": 3, \\\"189\\\": 2, \\\"16\\\": 20, \\\"94\\\": 3, \\\"27\\\": 7, \\\"110\\\": 4, \\\"3\\\": 36, \\\"190\\\": 2, \\\"93\\\": 3, \\\"56\\\": 7, \\\"38\\\": 7, \\\"25\\\": 13, \\\"113\\\": 4, \\\"95\\\": 4, \\\"112\\\": 4, \\\"96\\\": 5, \\\"70\\\": 6, \\\"68\\\": 5, \\\"69\\\": 6, \\\"37\\\": 7, \\\"150\\\": 3, \\\"67\\\": 6, \\\"301\\\": 1, \\\"299\\\": 1, \\\"111\\\": 4, \\\"114\\\": 4, \\\"57\\\": 7, \\\"191\\\": 1, \\\"149\\\": 1, \\\"300\\\": 1, \\\"192\\\": 1, \\\"41\\\": 9, \\\"193\\\": 2, \\\"147\\\": 1, \\\"302\\\": 1, \\\"194\\\": 2, \\\"146\\\": 1, \\\"148\\\": 1, \\\"151\\\": 3, \\\"196\\\": 2, \\\"71\\\": 4, \\\"58\\\": 5, \\\"115\\\": 2, \\\"73\\\": 5, \\\"75\\\": 6, \\\"195\\\": 2, \\\"198\\\": 2, \\\"197\\\": 2, \\\"152\\\": 3, \\\"116\\\": 4, \\\"43\\\": 8, \\\"153\\\": 3, \\\"42\\\": 8, \\\"32\\\": 8, \\\"72\\\": 6, \\\"74\\\": 3, \\\"26\\\": 10, \\\"21\\\": 14, \\\"28\\\": 6, \\\"44\\\": 5, \\\"76\\\": 2, \\\"199\\\": 2, \\\"33\\\": 10, \\\"34\\\": 6, \\\"154\\\": 3, \\\"97\\\": 5, \\\"18\\\": 14, \\\"98\\\": 5, \\\"311\\\": 1, \\\"117\\\": 3, \\\"314\\\": 1, \\\"312\\\": 1, \\\"319\\\": 1, \\\"305\\\": 1, \\\"101\\\": 5, \\\"46\\\": 7, \\\"308\\\": 1, \\\"19\\\": 15, \\\"303\\\": 1, \\\"318\\\": 1, \\\"307\\\": 1, \\\"304\\\": 1, \\\"201\\\": 2, \\\"155\\\": 3, \\\"45\\\": 7, \\\"316\\\": 1, \\\"200\\\": 1, \\\"313\\\": 1, \\\"315\\\": 1, \\\"309\\\": 1, \\\"52\\\": 8, \\\"306\\\": 1, \\\"310\\\": 1, \\\"320\\\": 1, \\\"202\\\": 1, \\\"100\\\": 2, \\\"99\\\": 1, \\\"321\\\": 1, \\\"317\\\": 1, \\\"51\\\": 3, \\\"22\\\": 11, \\\"204\\\": 2, \\\"206\\\": 2, \\\"205\\\": 2, \\\"47\\\": 7, \\\"203\\\": 2, \\\"322\\\": 1, \\\"207\\\": 2, \\\"323\\\": 1, \\\"59\\\": 7, \\\"60\\\": 7, \\\"53\\\": 4, \\\"324\\\": 1, \\\"209\\\": 2, \\\"61\\\": 3, \\\"77\\\": 3, \\\"118\\\": 3, \\\"333\\\": 1, \\\"23\\\": 13, \\\"330\\\": 1, \\\"156\\\": 3, \\\"327\\\": 1, \\\"157\\\": 3, \\\"48\\\": 8, \\\"328\\\": 1, \\\"326\\\": 1, \\\"332\\\": 1, \\\"331\\\": 1, \\\"329\\\": 1, \\\"325\\\": 1, \\\"208\\\": 2, \\\"158\\\": 3, \\\"335\\\": 1, \\\"49\\\": 5, \\\"102\\\": 5, \\\"119\\\": 4, \\\"334\\\": 1, \\\"79\\\": 6, \\\"103\\\": 3, \\\"210\\\": 2, \\\"121\\\": 4, \\\"120\\\": 2, \\\"62\\\": 7, \\\"211\\\": 2, \\\"63\\\": 7, \\\"78\\\": 6, \\\"160\\\": 3, \\\"212\\\": 2, \\\"341\\\": 1, \\\"80\\\": 4, \\\"344\\\": 1, \\\"342\\\": 1, \\\"336\\\": 1, \\\"337\\\": 1, \\\"338\\\": 1, \\\"213\\\": 1, \\\"343\\\": 1, \\\"123\\\": 4, \\\"122\\\": 4, \\\"340\\\": 1, \\\"339\\\": 1, \\\"159\\\": 2, \\\"224\\\": 2, \\\"35\\\": 8, \\\"214\\\": 2, \\\"127\\\": 2, \\\"223\\\": 2, \\\"161\\\": 3, \\\"222\\\": 2, \\\"217\\\": 2, \\\"83\\\": 4, \\\"220\\\": 2, \\\"225\\\": 2, \\\"218\\\": 2, \\\"219\\\": 2, \\\"226\\\": 2, \\\"81\\\": 2, \\\"84\\\": 6, \\\"104\\\": 5, \\\"125\\\": 4, \\\"221\\\": 2, \\\"126\\\": 4, \\\"215\\\": 2, \\\"124\\\": 2, \\\"216\\\": 2, \\\"82\\\": 2, \\\"227\\\": 2, \\\"85\\\": 2, \\\"229\\\": 2, \\\"129\\\": 2, \\\"105\\\": 5, \\\"230\\\": 2, \\\"231\\\": 2, \\\"50\\\": 3, \\\"130\\\": 4, \\\"233\\\": 2, \\\"128\\\": 2, \\\"234\\\": 2, \\\"232\\\": 2, \\\"228\\\": 2, \\\"162\\\": 3, \\\"236\\\": 2, \\\"240\\\": 2, \\\"238\\\": 2, \\\"241\\\": 2, \\\"64\\\": 3, \\\"235\\\": 2, \\\"131\\\": 4, \\\"237\\\": 2, \\\"239\\\": 2, \\\"242\\\": 2, \\\"163\\\": 3, \\\"345\\\": 1, \\\"250\\\": 1, \\\"349\\\": 1, \\\"351\\\": 1, \\\"249\\\": 1, \\\"352\\\": 1, \\\"244\\\": 2, \\\"354\\\": 1, \\\"346\\\": 1, \\\"350\\\": 1, \\\"355\\\": 1, \\\"245\\\": 1, \\\"247\\\": 1, \\\"353\\\": 1, \\\"248\\\": 1, \\\"243\\\": 2, \\\"348\\\": 1, \\\"251\\\": 1, \\\"246\\\": 1, \\\"347\\\": 1, \\\"164\\\": 3, \\\"359\\\": 1, \\\"356\\\": 1, \\\"357\\\": 1, \\\"358\\\": 1, \\\"256\\\": 2, \\\"255\\\": 2, \\\"257\\\": 2, \\\"362\\\": 1, \\\"367\\\": 1, \\\"254\\\": 1, \\\"366\\\": 1, \\\"363\\\": 1, \\\"54\\\": 1, \\\"364\\\": 1, \\\"252\\\": 1, \\\"373\\\": 1, \\\"370\\\": 1, \\\"369\\\": 1, \\\"132\\\": 1, \\\"368\\\": 1, \\\"365\\\": 1, \\\"374\\\": 1, \\\"165\\\": 3, \\\"253\\\": 1, \\\"361\\\": 1, \\\"166\\\": 1, \\\"371\\\": 1, \\\"372\\\": 1, \\\"360\\\": 1, \\\"258\\\": 1, \\\"376\\\": 1, \\\"375\\\": 1, \\\"377\\\": 1, \\\"133\\\": 2, \\\"378\\\": 1, \\\"262\\\": 2, \\\"264\\\": 2, \\\"382\\\": 1, \\\"380\\\": 1, \\\"168\\\": 2, \\\"167\\\": 3, \\\"379\\\": 1, \\\"263\\\": 1, \\\"259\\\": 1, \\\"260\\\": 1, \\\"381\\\": 1, \\\"383\\\": 1, \\\"261\\\": 1, \\\"170\\\": 3, \\\"169\\\": 3, \\\"384\\\": 1, \\\"390\\\": 1, \\\"389\\\": 1, \\\"387\\\": 1, \\\"385\\\": 1, \\\"386\\\": 1, \\\"265\\\": 1, \\\"172\\\": 3, \\\"171\\\": 2, \\\"388\\\": 1, \\\"39\\\": 4, \\\"394\\\": 1, \\\"393\\\": 1, \\\"391\\\": 1, \\\"267\\\": 2, \\\"266\\\": 1, \\\"392\\\": 1, \\\"399\\\": 1, \\\"134\\\": 1, \\\"395\\\": 1, \\\"397\\\": 1, \\\"396\\\": 1, \\\"401\\\": 1, \\\"403\\\": 1, \\\"400\\\": 1, \\\"402\\\": 1, \\\"398\\\": 1, \\\"173\\\": 2, \\\"404\\\": 1, \\\"405\\\": 1, \\\"407\\\": 1, \\\"408\\\": 1, \\\"406\\\": 1, \\\"409\\\": 1, \\\"175\\\": 3, \\\"410\\\": 1, \\\"174\\\": 3, \\\"412\\\": 1, \\\"411\\\": 1, \\\"414\\\": 1, \\\"268\\\": 2, \\\"413\\\": 1, \\\"415\\\": 1, \\\"416\\\": 1, \\\"417\\\": 1, \\\"269\\\": 1, \\\"86\\\": 3, \\\"135\\\": 3, \\\"270\\\": 2, \\\"176\\\": 3, \\\"271\\\": 2, \\\"87\\\": 3, \\\"418\\\": 1, \\\"420\\\": 1, \\\"419\\\": 1, \\\"421\\\": 1, \\\"423\\\": 1, \\\"425\\\": 1, \\\"426\\\": 1, \\\"424\\\": 1, \\\"422\\\": 1, \\\"432\\\": 1, \\\"430\\\": 1, \\\"177\\\": 2, \\\"106\\\": 2, \\\"429\\\": 1, \\\"427\\\": 1, \\\"272\\\": 2, \\\"433\\\": 1, \\\"428\\\": 1, \\\"136\\\": 2, \\\"431\\\": 1, \\\"273\\\": 2, \\\"278\\\": 2, \\\"276\\\": 2, \\\"280\\\": 2, \\\"274\\\": 2, \\\"179\\\": 3, \\\"137\\\": 3, \\\"178\\\": 3, \\\"279\\\": 2, \\\"281\\\": 2, \\\"275\\\": 2, \\\"282\\\": 2, \\\"277\\\": 2, \\\"437\\\": 1, \\\"434\\\": 1, \\\"438\\\": 1, \\\"435\\\": 1, \\\"436\\\": 1, \\\"283\\\": 2, \\\"138\\\": 3, \\\"439\\\": 1, \\\"443\\\": 1, \\\"442\\\": 1, \\\"441\\\": 1, \\\"444\\\": 1, \\\"284\\\": 2, \\\"440\\\": 1, \\\"450\\\": 1, \\\"285\\\": 1, \\\"446\\\": 1, \\\"448\\\": 1, \\\"286\\\": 2, \\\"445\\\": 1, \\\"449\\\": 1, \\\"447\\\": 1, \\\"180\\\": 1, \\\"451\\\": 1, \\\"107\\\": 1, \\\"452\\\": 1, \\\"453\\\": 1, \\\"456\\\": 1, \\\"287\\\": 1, \\\"288\\\": 2, \\\"457\\\": 1, \\\"459\\\": 1, \\\"458\\\": 1, \\\"454\\\": 1, \\\"455\\\": 1, \\\"461\\\": 1, \\\"460\\\": 1, \\\"182\\\": 1, \\\"181\\\": 1}\", \"index_word\": \"{\\\"1\\\": \\\"the\\\", \\\"2\\\": \\\"of\\\", \\\"3\\\": \\\"a\\\", \\\"4\\\": \\\"and\\\", \\\"5\\\": \\\"return\\\", \\\"6\\\": \\\"is\\\", \\\"7\\\": \\\"given\\\", \\\"8\\\": \\\"an\\\", \\\"9\\\": \\\"in\\\", \\\"10\\\": \\\"you\\\", \\\"11\\\": \\\"array\\\", \\\"12\\\": \\\"that\\\", \\\"13\\\": \\\"nums\\\", \\\"14\\\": \\\"to\\\", \\\"15\\\": \\\"1\\\", \\\"16\\\": \\\"integer\\\", \\\"17\\\": \\\"n\\\", \\\"18\\\": \\\"it\\\", \\\"19\\\": \\\"if\\\", \\\"20\\\": \\\"all\\\", \\\"21\\\": \\\"string\\\", \\\"22\\\": \\\"two\\\", \\\"23\\\": \\\"number\\\", \\\"24\\\": \\\"are\\\", \\\"25\\\": \\\"or\\\", \\\"26\\\": \\\"s\\\", \\\"27\\\": \\\"node\\\", \\\"28\\\": \\\"linked\\\", \\\"29\\\": \\\"element\\\", \\\"30\\\": \\\"k\\\", \\\"31\\\": \\\"by\\\", \\\"32\\\": \\\"i\\\", \\\"33\\\": \\\"each\\\", \\\"34\\\": \\\"list\\\", \\\"35\\\": \\\"index\\\", \\\"36\\\": \\\"not\\\", \\\"37\\\": \\\"with\\\", \\\"38\\\": \\\"0\\\", \\\"39\\\": \\\"word\\\", \\\"40\\\": \\\"may\\\", \\\"41\\\": \\\"order\\\", \\\"42\\\": \\\"such\\\", \\\"43\\\": \\\"be\\\", \\\"44\\\": \\\"sorted\\\", \\\"45\\\": \\\"on\\\", \\\"46\\\": \\\"can\\\", \\\"47\\\": \\\"m\\\", \\\"48\\\": \\\"any\\\", \\\"49\\\": \\\"at\\\", \\\"50\\\": \\\"grid\\\", \\\"51\\\": \\\"amount\\\", \\\"52\\\": \\\"from\\\", \\\"53\\\": \\\"sequence\\\", \\\"54\\\": \\\"gas\\\", \\\"55\\\": \\\"x\\\", \\\"56\\\": \\\"binary\\\", \\\"57\\\": \\\"function\\\", \\\"58\\\": \\\"wordlist\\\", \\\"59\\\": \\\"length\\\", \\\"60\\\": \\\"longest\\\", \\\"61\\\": \\\"letter\\\", \\\"62\\\": \\\"find\\\", \\\"63\\\": \\\"there\\\", \\\"64\\\": \\\"point\\\", \\\"65\\\": \\\"assume\\\", \\\"66\\\": \\\"representing\\\", \\\"67\\\": \\\"same\\\", \\\"68\\\": \\\"2\\\", \\\"69\\\": \\\"must\\\", \\\"70\\\": \\\"without\\\", \\\"71\\\": \\\"every\\\", \\\"72\\\": \\\"note\\\", \\\"73\\\": \\\"substring\\\", \\\"74\\\": \\\"palindrome\\\", \\\"75\\\": \\\"possible\\\", \\\"76\\\": \\\"lists\\\", \\\"77\\\": \\\"digit\\\", \\\"78\\\": \\\"write\\\", \\\"79\\\": \\\"empty\\\", \\\"80\\\": \\\"non\\\", \\\"81\\\": \\\"odd\\\", \\\"82\\\": \\\"even\\\", \\\"83\\\": \\\"o\\\", \\\"84\\\": \\\"time\\\", \\\"85\\\": \\\"water\\\", \\\"86\\\": \\\"beginword\\\", \\\"87\\\": \\\"dictionary\\\", \\\"88\\\": \\\"2d\\\", \\\"89\\\": \\\"matrix\\\", \\\"90\\\": \\\"have\\\", \\\"91\\\": \\\"input\\\", \\\"92\\\": \\\"do\\\", \\\"93\\\": \\\"tree\\\", \\\"94\\\": \\\"value\\\", \\\"95\\\": \\\"adjacent\\\", \\\"96\\\": \\\"using\\\", \\\"97\\\": \\\"into\\\", \\\"98\\\": \\\"one\\\", \\\"99\\\": \\\"house\\\", \\\"100\\\": \\\"money\\\", \\\"101\\\": \\\"maximum\\\", \\\"102\\\": \\\"true\\\", \\\"103\\\": \\\"prefix\\\", \\\"104\\\": \\\"first\\\", \\\"105\\\": \\\"represents\\\", \\\"106\\\": \\\"move\\\", \\\"107\\\": \\\"robot\\\", \\\"108\\\": \\\"than\\\", \\\"109\\\": \\\"root\\\", \\\"110\\\": \\\"indexed\\\", \\\"111\\\": \\\"so\\\", \\\"112\\\": \\\"respectively\\\", \\\"113\\\": \\\"solve\\\", \\\"114\\\": \\\"problem\\\", \\\"115\\\": \\\"partition\\\", \\\"116\\\": \\\"doe\\\", \\\"117\\\": \\\"only\\\", \\\"118\\\": \\\"answer\\\", \\\"119\\\": \\\"false\\\", \\\"120\\\": \\\"common\\\", \\\"121\\\": \\\"no\\\", \\\"122\\\": \\\"character\\\", \\\"123\\\": \\\"otherwise\\\", \\\"124\\\": \\\"group\\\", \\\"125\\\": \\\"extra\\\", \\\"126\\\": \\\"space\\\", \\\"127\\\": \\\"complexity\\\", \\\"128\\\": \\\"land\\\", \\\"129\\\": \\\"surrounded\\\", \\\"130\\\": \\\"formed\\\", \\\"131\\\": \\\"where\\\", \\\"132\\\": \\\"station\\\", \\\"133\\\": \\\"t\\\", \\\"134\\\": \\\"coin\\\", \\\"135\\\": \\\"endword\\\", \\\"136\\\": \\\"right\\\", \\\"137\\\": \\\"sum\\\", \\\"138\\\": \\\"bit\\\", \\\"139\\\": \\\"size\\\", \\\"140\\\": \\\"majority\\\", \\\"141\\\": \\\"exists\\\", \\\"142\\\": \\\"image\\\", \\\"143\\\": \\\"place\\\", \\\"144\\\": \\\"which\\\", \\\"145\\\": \\\"smallest\\\", \\\"146\\\": \\\"red\\\", \\\"147\\\": \\\"white\\\", \\\"148\\\": \\\"blue\\\", \\\"149\\\": \\\"color\\\", \\\"150\\\": \\\"will\\\", \\\"151\\\": \\\"this\\\", \\\"152\\\": \\\"for\\\", \\\"153\\\": \\\"need\\\", \\\"154\\\": \\\"ascending\\\", \\\"155\\\": \\\"along\\\", \\\"156\\\": \\\"combination\\\", \\\"157\\\": \\\"map\\\", \\\"158\\\": \\\"distinct\\\", \\\"159\\\": \\\"phrase\\\", \\\"160\\\": \\\"characters\\\", \\\"161\\\": \\\"considered\\\", \\\"162\\\": \\\"four\\\", \\\"163\\\": \\\"repeating\\\", \\\"164\\\": \\\"unique\\\", \\\"165\\\": \\\"sk\\\", \\\"166\\\": \\\"cost\\\", \\\"167\\\": \\\"contains\\\", \\\"168\\\": \\\"words\\\", \\\"169\\\": \\\"take\\\", \\\"170\\\": \\\"reach\\\", \\\"171\\\": \\\"top\\\", \\\"172\\\": \\\"either\\\", \\\"173\\\": \\\"up\\\", \\\"174\\\": \\\"path\\\", \\\"175\\\": \\\"down\\\", \\\"176\\\": \\\"transformation\\\", \\\"177\\\": \\\"e\\\", \\\"178\\\": \\\"reverse\\\", \\\"179\\\": \\\"except\\\", \\\"180\\\": \\\"corner\\\", \\\"181\\\": \\\"needle\\\", \\\"182\\\": \\\"haystack\\\", \\\"183\\\": \\\"appears\\\", \\\"184\\\": \\\"more\\\", \\\"185\\\": \\\"always\\\", \\\"186\\\": \\\"rotate\\\", \\\"187\\\": \\\"clockwise\\\", \\\"188\\\": \\\"rotation\\\", \\\"189\\\": \\\"search\\\", \\\"190\\\": \\\"kth\\\", \\\"191\\\": \\\"object\\\", \\\"192\\\": \\\"sort\\\", \\\"193\\\": \\\"them\\\", \\\"194\\\": \\\"represent\\\", \\\"195\\\": \\\"si\\\", \\\"196\\\": \\\"begigiven\\\", \\\"197\\\": \\\"partitioning\\\", \\\"198\\\": \\\"nword\\\", \\\"199\\\": \\\"merge\\\", \\\"200\\\": \\\"rob\\\", \\\"201\\\": \\\"ha\\\", \\\"202\\\": \\\"police\\\", \\\"203\\\": \\\"nums1\\\", \\\"204\\\": \\\"nums2\\\", \\\"205\\\": \\\"median\\\", \\\"206\\\": \\\"arrays\\\", \\\"207\\\": \\\"unsorted\\\", \\\"208\\\": \\\"containing\\\", \\\"209\\\": \\\"inclusive\\\", \\\"210\\\": \\\"amongst\\\", \\\"211\\\": \\\"strings\\\", \\\"212\\\": \\\"after\\\", \\\"213\\\": \\\"alphanumeric\\\", \\\"214\\\": \\\"head\\\", \\\"215\\\": \\\"singly\\\", \\\"216\\\": \\\"together\\\", \\\"217\\\": \\\"followed\\\", \\\"218\\\": \\\"indices\\\", \\\"219\\\": \\\"reordered\\\", \\\"220\\\": \\\"second\\\", \\\"221\\\": \\\"relative\\\", \\\"222\\\": \\\"inside\\\", \\\"223\\\": \\\"both\\\", \\\"224\\\": \\\"should\\\", \\\"225\\\": \\\"remain\\\", \\\"226\\\": \\\"wa\\\", \\\"227\\\": \\\"'1's\\\", \\\"228\\\": \\\"'0's\\\", \\\"229\\\": \\\"islands\\\", \\\"230\\\": \\\"island\\\", \\\"231\\\": \\\"connecting\\\", \\\"232\\\": \\\"horizontally\\\", \\\"233\\\": \\\"vertically\\\", \\\"234\\\": \\\"edge\\\", \\\"235\\\": \\\"points\\\", \\\"236\\\": \\\"xi\\\", \\\"237\\\": \\\"yi\\\", \\\"238\\\": \\\"y\\\", \\\"239\\\": \\\"plane\\\", \\\"240\\\": \\\"lie\\\", \\\"241\\\": \\\"straight\\\", \\\"242\\\": \\\"line\\\", \\\"243\\\": \\\"values\\\", \\\"244\\\": \\\"your\\\", \\\"245\\\": \\\"rotated\\\", \\\"246\\\": \\\"pivot\\\", \\\"247\\\": \\\"4\\\", \\\"248\\\": \\\"5\\\", \\\"249\\\": \\\"6\\\", \\\"250\\\": \\\"7\\\", \\\"251\\\": \\\"target\\\", \\\"252\\\": \\\"ith\\\", \\\"253\\\": \\\"tank\\\", \\\"254\\\": \\\"travel\\\", \\\"255\\\": \\\"around\\\", \\\"256\\\": \\\"once\\\", \\\"257\\\": \\\"guaranteed\\\", \\\"258\\\": \\\"window\\\", \\\"259\\\": \\\"peak\\\", \\\"260\\\": \\\"strictly\\\", \\\"261\\\": \\\"greater\\\", \\\"262\\\": \\\"multiple\\\", \\\"263\\\": \\\"peaks\\\", \\\"264\\\": \\\"outside\\\", \\\"265\\\": \\\"climb\\\", \\\"266\\\": \\\"anagram\\\", \\\"267\\\": \\\"different\\\", \\\"268\\\": \\\"modifying\\\", \\\"269\\\": \\\"repeated\\\", \\\"270\\\": \\\"s1\\\", \\\"271\\\": \\\"s2\\\", \\\"272\\\": \\\"left\\\", \\\"273\\\": \\\"negative\\\", \\\"274\\\": \\\"integers\\\", \\\"275\\\": \\\"stored\\\", \\\"276\\\": \\\"their\\\", \\\"277\\\": \\\"single\\\", \\\"278\\\": \\\"add\\\", \\\"279\\\": \\\"contain\\\", \\\"280\\\": \\\"leading\\\", \\\"281\\\": \\\"zero\\\", \\\"282\\\": \\\"itself\\\", \\\"283\\\": \\\"unsigned\\\", \\\"284\\\": \\\"initially\\\", \\\"285\\\": \\\"bottom\\\", \\\"286\\\": \\\"equal\\\", \\\"287\\\": \\\"product\\\", \\\"288\\\": \\\"32\\\", \\\"289\\\": \\\"\\\\u230an\\\", \\\"290\\\": \\\"2\\\\u230b\\\", \\\"291\\\": \\\"times\\\", \\\"292\\\": \\\"90\\\", \\\"293\\\": \\\"degree\\\", \\\"294\\\": \\\"mean\\\", \\\"295\\\": \\\"modify\\\", \\\"296\\\": \\\"directly\\\", \\\"297\\\": \\\"allocate\\\", \\\"298\\\": \\\"another\\\", \\\"299\\\": \\\"colored\\\", \\\"300\\\": \\\"we\\\", \\\"301\\\": \\\"use\\\", \\\"302\\\": \\\"library's\\\", \\\"303\\\": \\\"professional\\\", \\\"304\\\": \\\"robber\\\", \\\"305\\\": \\\"planning\\\", \\\"306\\\": \\\"street\\\", \\\"307\\\": \\\"certain\\\", \\\"308\\\": \\\"stashed\\\", \\\"309\\\": \\\"constraint\\\", \\\"310\\\": \\\"stopping\\\", \\\"311\\\": \\\"robbing\\\", \\\"312\\\": \\\"security\\\", \\\"313\\\": \\\"system\\\", \\\"314\\\": \\\"connected\\\", \\\"315\\\": \\\"automatically\\\", \\\"316\\\": \\\"contact\\\", \\\"317\\\": \\\"were\\\", \\\"318\\\": \\\"broken\\\", \\\"319\\\": \\\"night\\\", \\\"320\\\": \\\"tonight\\\", \\\"321\\\": \\\"alerting\\\", \\\"322\\\": \\\"missing\\\", \\\"323\\\": \\\"positive\\\", \\\"324\\\": \\\"consecutive\\\", \\\"325\\\": \\\"9\\\", \\\"326\\\": \\\"could\\\", \\\"327\\\": \\\"mapping\\\", \\\"328\\\": \\\"just\\\", \\\"329\\\": \\\"like\\\", \\\"330\\\": \\\"telephone\\\", \\\"331\\\": \\\"buttons\\\", \\\"332\\\": \\\"below\\\", \\\"333\\\": \\\"letters\\\", \\\"334\\\": \\\"least\\\", \\\"335\\\": \\\"twice\\\", \\\"336\\\": \\\"converting\\\", \\\"337\\\": \\\"uppercase\\\", \\\"338\\\": \\\"lowercase\\\", \\\"339\\\": \\\"removing\\\", \\\"340\\\": \\\"read\\\", \\\"341\\\": \\\"forward\\\", \\\"342\\\": \\\"backward\\\", \\\"343\\\": \\\"include\\\", \\\"344\\\": \\\"numbers\\\", \\\"345\\\": \\\"exist\\\", \\\"346\\\": \\\"prior\\\", \\\"347\\\": \\\"being\\\", \\\"348\\\": \\\"passed\\\", \\\"349\\\": \\\"possibly\\\", \\\"350\\\": \\\"unknown\\\", \\\"351\\\": \\\"resulting\\\", \\\"352\\\": \\\"example\\\", \\\"353\\\": \\\"might\\\", \\\"354\\\": \\\"3\\\", \\\"355\\\": \\\"become\\\", \\\"356\\\": \\\"elements\\\", \\\"357\\\": \\\"subset\\\", \\\"358\\\": \\\"power\\\", \\\"359\\\": \\\"set\\\", \\\"360\\\": \\\"endwordthere\\\", \\\"361\\\": \\\"circular\\\", \\\"362\\\": \\\"route\\\", \\\"363\\\": \\\"car\\\", \\\"364\\\": \\\"unlimited\\\", \\\"365\\\": \\\"next\\\", \\\"366\\\": \\\"th\\\", \\\"367\\\": \\\"begin\\\", \\\"368\\\": \\\"journey\\\", \\\"369\\\": \\\"stations\\\", \\\"370\\\": \\\"starting\\\", \\\"371\\\": \\\"station's\\\", \\\"372\\\": \\\"circuit\\\", \\\"373\\\": \\\"direction\\\", \\\"374\\\": \\\"solution\\\", \\\"375\\\": \\\"minimum\\\", \\\"376\\\": \\\"including\\\", \\\"377\\\": \\\"duplicates\\\", \\\"378\\\": \\\"included\\\", \\\"379\\\": \\\"neighbors\\\", \\\"380\\\": \\\"imagine\\\", \\\"381\\\": \\\"\\\\u221e\\\", \\\"382\\\": \\\"other\\\", \\\"383\\\": \\\"neighbor\\\", \\\"384\\\": \\\"climbing\\\", \\\"385\\\": \\\"staircase\\\", \\\"386\\\": \\\"step\\\", \\\"387\\\": \\\"steps\\\", \\\"388\\\": \\\"how\\\", \\\"389\\\": \\\"many\\\", \\\"390\\\": \\\"way\\\", \\\"391\\\": \\\"rearranging\\\", \\\"392\\\": \\\"typically\\\", \\\"393\\\": \\\"original\\\", \\\"394\\\": \\\"exactly\\\", \\\"395\\\": \\\"denomination\\\", \\\"396\\\": \\\"total\\\", \\\"397\\\": \\\"fewest\\\", \\\"398\\\": \\\"make\\\", \\\"399\\\": \\\"cannot\\\", \\\"400\\\": \\\"made\\\", \\\"401\\\": \\\"coins\\\", \\\"402\\\": \\\"infinite\\\", \\\"403\\\": \\\"kind\\\", \\\"404\\\": \\\"pair\\\", \\\"405\\\": \\\"parentheses\\\", \\\"406\\\": \\\"generate\\\", \\\"407\\\": \\\"well\\\", \\\"408\\\": \\\"parenthesis\\\", \\\"409\\\": \\\"tree's\\\", \\\"410\\\": \\\"depth\\\", \\\"411\\\": \\\"farthest\\\", \\\"412\\\": \\\"leaf\\\", \\\"413\\\": \\\"revers\\\", \\\"414\\\": \\\"memory\\\", \\\"415\\\": \\\"range\\\", \\\"416\\\": \\\"us\\\", \\\"417\\\": \\\"constant\\\", \\\"418\\\": \\\"inorder\\\", \\\"419\\\": \\\"traversal\\\", \\\"420\\\": \\\"nodes'\\\", \\\"421\\\": \\\"worddict\\\", \\\"422\\\": \\\"segmented\\\", \\\"423\\\": \\\"separated\\\", \\\"424\\\": \\\"reused\\\", \\\"425\\\": \\\"segmentation\\\", \\\"426\\\": \\\"shortest\\\", \\\"427\\\": \\\"increasing\\\", \\\"428\\\": \\\"cell\\\", \\\"429\\\": \\\"directions\\\", \\\"430\\\": \\\"diagonally\\\", \\\"431\\\": \\\"boundary\\\", \\\"432\\\": \\\"wrap\\\", \\\"433\\\": \\\"allowed\\\", \\\"434\\\": \\\"representation\\\", \\\"435\\\": \\\"'1'\\\", \\\"436\\\": \\\"also\\\", \\\"437\\\": \\\"known\\\", \\\"438\\\": \\\"hamming\\\", \\\"439\\\": \\\"weight\\\", \\\"440\\\": \\\"positioned\\\", \\\"441\\\": \\\"array's\\\", \\\"442\\\": \\\"jump\\\", \\\"443\\\": \\\"position\\\", \\\"444\\\": \\\"last\\\", \\\"445\\\": \\\"located\\\", \\\"446\\\": \\\"try\\\", \\\"447\\\": \\\"test\\\", \\\"448\\\": \\\"case\\\", \\\"449\\\": \\\"generated\\\", \\\"450\\\": \\\"le\\\", \\\"451\\\": \\\"109\\\", \\\"452\\\": \\\"subarray\\\", \\\"453\\\": \\\"largest\\\", \\\"454\\\": \\\"suffix\\\", \\\"455\\\": \\\"fit\\\", \\\"456\\\": \\\"algorithm\\\", \\\"457\\\": \\\"run\\\", \\\"458\\\": \\\"division\\\", \\\"459\\\": \\\"operation\\\", \\\"460\\\": \\\"occurrence\\\", \\\"461\\\": \\\"part\\\"}\", \"word_index\": \"{\\\"the\\\": 1, \\\"of\\\": 2, \\\"a\\\": 3, \\\"and\\\": 4, \\\"return\\\": 5, \\\"is\\\": 6, \\\"given\\\": 7, \\\"an\\\": 8, \\\"in\\\": 9, \\\"you\\\": 10, \\\"array\\\": 11, \\\"that\\\": 12, \\\"nums\\\": 13, \\\"to\\\": 14, \\\"1\\\": 15, \\\"integer\\\": 16, \\\"n\\\": 17, \\\"it\\\": 18, \\\"if\\\": 19, \\\"all\\\": 20, \\\"string\\\": 21, \\\"two\\\": 22, \\\"number\\\": 23, \\\"are\\\": 24, \\\"or\\\": 25, \\\"s\\\": 26, \\\"node\\\": 27, \\\"linked\\\": 28, \\\"element\\\": 29, \\\"k\\\": 30, \\\"by\\\": 31, \\\"i\\\": 32, \\\"each\\\": 33, \\\"list\\\": 34, \\\"index\\\": 35, \\\"not\\\": 36, \\\"with\\\": 37, \\\"0\\\": 38, \\\"word\\\": 39, \\\"may\\\": 40, \\\"order\\\": 41, \\\"such\\\": 42, \\\"be\\\": 43, \\\"sorted\\\": 44, \\\"on\\\": 45, \\\"can\\\": 46, \\\"m\\\": 47, \\\"any\\\": 48, \\\"at\\\": 49, \\\"grid\\\": 50, \\\"amount\\\": 51, \\\"from\\\": 52, \\\"sequence\\\": 53, \\\"gas\\\": 54, \\\"x\\\": 55, \\\"binary\\\": 56, \\\"function\\\": 57, \\\"wordlist\\\": 58, \\\"length\\\": 59, \\\"longest\\\": 60, \\\"letter\\\": 61, \\\"find\\\": 62, \\\"there\\\": 63, \\\"point\\\": 64, \\\"assume\\\": 65, \\\"representing\\\": 66, \\\"same\\\": 67, \\\"2\\\": 68, \\\"must\\\": 69, \\\"without\\\": 70, \\\"every\\\": 71, \\\"note\\\": 72, \\\"substring\\\": 73, \\\"palindrome\\\": 74, \\\"possible\\\": 75, \\\"lists\\\": 76, \\\"digit\\\": 77, \\\"write\\\": 78, \\\"empty\\\": 79, \\\"non\\\": 80, \\\"odd\\\": 81, \\\"even\\\": 82, \\\"o\\\": 83, \\\"time\\\": 84, \\\"water\\\": 85, \\\"beginword\\\": 86, \\\"dictionary\\\": 87, \\\"2d\\\": 88, \\\"matrix\\\": 89, \\\"have\\\": 90, \\\"input\\\": 91, \\\"do\\\": 92, \\\"tree\\\": 93, \\\"value\\\": 94, \\\"adjacent\\\": 95, \\\"using\\\": 96, \\\"into\\\": 97, \\\"one\\\": 98, \\\"house\\\": 99, \\\"money\\\": 100, \\\"maximum\\\": 101, \\\"true\\\": 102, \\\"prefix\\\": 103, \\\"first\\\": 104, \\\"represents\\\": 105, \\\"move\\\": 106, \\\"robot\\\": 107, \\\"than\\\": 108, \\\"root\\\": 109, \\\"indexed\\\": 110, \\\"so\\\": 111, \\\"respectively\\\": 112, \\\"solve\\\": 113, \\\"problem\\\": 114, \\\"partition\\\": 115, \\\"doe\\\": 116, \\\"only\\\": 117, \\\"answer\\\": 118, \\\"false\\\": 119, \\\"common\\\": 120, \\\"no\\\": 121, \\\"character\\\": 122, \\\"otherwise\\\": 123, \\\"group\\\": 124, \\\"extra\\\": 125, \\\"space\\\": 126, \\\"complexity\\\": 127, \\\"land\\\": 128, \\\"surrounded\\\": 129, \\\"formed\\\": 130, \\\"where\\\": 131, \\\"station\\\": 132, \\\"t\\\": 133, \\\"coin\\\": 134, \\\"endword\\\": 135, \\\"right\\\": 136, \\\"sum\\\": 137, \\\"bit\\\": 138, \\\"size\\\": 139, \\\"majority\\\": 140, \\\"exists\\\": 141, \\\"image\\\": 142, \\\"place\\\": 143, \\\"which\\\": 144, \\\"smallest\\\": 145, \\\"red\\\": 146, \\\"white\\\": 147, \\\"blue\\\": 148, \\\"color\\\": 149, \\\"will\\\": 150, \\\"this\\\": 151, \\\"for\\\": 152, \\\"need\\\": 153, \\\"ascending\\\": 154, \\\"along\\\": 155, \\\"combination\\\": 156, \\\"map\\\": 157, \\\"distinct\\\": 158, \\\"phrase\\\": 159, \\\"characters\\\": 160, \\\"considered\\\": 161, \\\"four\\\": 162, \\\"repeating\\\": 163, \\\"unique\\\": 164, \\\"sk\\\": 165, \\\"cost\\\": 166, \\\"contains\\\": 167, \\\"words\\\": 168, \\\"take\\\": 169, \\\"reach\\\": 170, \\\"top\\\": 171, \\\"either\\\": 172, \\\"up\\\": 173, \\\"path\\\": 174, \\\"down\\\": 175, \\\"transformation\\\": 176, \\\"e\\\": 177, \\\"reverse\\\": 178, \\\"except\\\": 179, \\\"corner\\\": 180, \\\"needle\\\": 181, \\\"haystack\\\": 182, \\\"appears\\\": 183, \\\"more\\\": 184, \\\"always\\\": 185, \\\"rotate\\\": 186, \\\"clockwise\\\": 187, \\\"rotation\\\": 188, \\\"search\\\": 189, \\\"kth\\\": 190, \\\"object\\\": 191, \\\"sort\\\": 192, \\\"them\\\": 193, \\\"represent\\\": 194, \\\"si\\\": 195, \\\"begigiven\\\": 196, \\\"partitioning\\\": 197, \\\"nword\\\": 198, \\\"merge\\\": 199, \\\"rob\\\": 200, \\\"ha\\\": 201, \\\"police\\\": 202, \\\"nums1\\\": 203, \\\"nums2\\\": 204, \\\"median\\\": 205, \\\"arrays\\\": 206, \\\"unsorted\\\": 207, \\\"containing\\\": 208, \\\"inclusive\\\": 209, \\\"amongst\\\": 210, \\\"strings\\\": 211, \\\"after\\\": 212, \\\"alphanumeric\\\": 213, \\\"head\\\": 214, \\\"singly\\\": 215, \\\"together\\\": 216, \\\"followed\\\": 217, \\\"indices\\\": 218, \\\"reordered\\\": 219, \\\"second\\\": 220, \\\"relative\\\": 221, \\\"inside\\\": 222, \\\"both\\\": 223, \\\"should\\\": 224, \\\"remain\\\": 225, \\\"wa\\\": 226, \\\"'1's\\\": 227, \\\"'0's\\\": 228, \\\"islands\\\": 229, \\\"island\\\": 230, \\\"connecting\\\": 231, \\\"horizontally\\\": 232, \\\"vertically\\\": 233, \\\"edge\\\": 234, \\\"points\\\": 235, \\\"xi\\\": 236, \\\"yi\\\": 237, \\\"y\\\": 238, \\\"plane\\\": 239, \\\"lie\\\": 240, \\\"straight\\\": 241, \\\"line\\\": 242, \\\"values\\\": 243, \\\"your\\\": 244, \\\"rotated\\\": 245, \\\"pivot\\\": 246, \\\"4\\\": 247, \\\"5\\\": 248, \\\"6\\\": 249, \\\"7\\\": 250, \\\"target\\\": 251, \\\"ith\\\": 252, \\\"tank\\\": 253, \\\"travel\\\": 254, \\\"around\\\": 255, \\\"once\\\": 256, \\\"guaranteed\\\": 257, \\\"window\\\": 258, \\\"peak\\\": 259, \\\"strictly\\\": 260, \\\"greater\\\": 261, \\\"multiple\\\": 262, \\\"peaks\\\": 263, \\\"outside\\\": 264, \\\"climb\\\": 265, \\\"anagram\\\": 266, \\\"different\\\": 267, \\\"modifying\\\": 268, \\\"repeated\\\": 269, \\\"s1\\\": 270, \\\"s2\\\": 271, \\\"left\\\": 272, \\\"negative\\\": 273, \\\"integers\\\": 274, \\\"stored\\\": 275, \\\"their\\\": 276, \\\"single\\\": 277, \\\"add\\\": 278, \\\"contain\\\": 279, \\\"leading\\\": 280, \\\"zero\\\": 281, \\\"itself\\\": 282, \\\"unsigned\\\": 283, \\\"initially\\\": 284, \\\"bottom\\\": 285, \\\"equal\\\": 286, \\\"product\\\": 287, \\\"32\\\": 288, \\\"\\\\u230an\\\": 289, \\\"2\\\\u230b\\\": 290, \\\"times\\\": 291, \\\"90\\\": 292, \\\"degree\\\": 293, \\\"mean\\\": 294, \\\"modify\\\": 295, \\\"directly\\\": 296, \\\"allocate\\\": 297, \\\"another\\\": 298, \\\"colored\\\": 299, \\\"we\\\": 300, \\\"use\\\": 301, \\\"library's\\\": 302, \\\"professional\\\": 303, \\\"robber\\\": 304, \\\"planning\\\": 305, \\\"street\\\": 306, \\\"certain\\\": 307, \\\"stashed\\\": 308, \\\"constraint\\\": 309, \\\"stopping\\\": 310, \\\"robbing\\\": 311, \\\"security\\\": 312, \\\"system\\\": 313, \\\"connected\\\": 314, \\\"automatically\\\": 315, \\\"contact\\\": 316, \\\"were\\\": 317, \\\"broken\\\": 318, \\\"night\\\": 319, \\\"tonight\\\": 320, \\\"alerting\\\": 321, \\\"missing\\\": 322, \\\"positive\\\": 323, \\\"consecutive\\\": 324, \\\"9\\\": 325, \\\"could\\\": 326, \\\"mapping\\\": 327, \\\"just\\\": 328, \\\"like\\\": 329, \\\"telephone\\\": 330, \\\"buttons\\\": 331, \\\"below\\\": 332, \\\"letters\\\": 333, \\\"least\\\": 334, \\\"twice\\\": 335, \\\"converting\\\": 336, \\\"uppercase\\\": 337, \\\"lowercase\\\": 338, \\\"removing\\\": 339, \\\"read\\\": 340, \\\"forward\\\": 341, \\\"backward\\\": 342, \\\"include\\\": 343, \\\"numbers\\\": 344, \\\"exist\\\": 345, \\\"prior\\\": 346, \\\"being\\\": 347, \\\"passed\\\": 348, \\\"possibly\\\": 349, \\\"unknown\\\": 350, \\\"resulting\\\": 351, \\\"example\\\": 352, \\\"might\\\": 353, \\\"3\\\": 354, \\\"become\\\": 355, \\\"elements\\\": 356, \\\"subset\\\": 357, \\\"power\\\": 358, \\\"set\\\": 359, \\\"endwordthere\\\": 360, \\\"circular\\\": 361, \\\"route\\\": 362, \\\"car\\\": 363, \\\"unlimited\\\": 364, \\\"next\\\": 365, \\\"th\\\": 366, \\\"begin\\\": 367, \\\"journey\\\": 368, \\\"stations\\\": 369, \\\"starting\\\": 370, \\\"station's\\\": 371, \\\"circuit\\\": 372, \\\"direction\\\": 373, \\\"solution\\\": 374, \\\"minimum\\\": 375, \\\"including\\\": 376, \\\"duplicates\\\": 377, \\\"included\\\": 378, \\\"neighbors\\\": 379, \\\"imagine\\\": 380, \\\"\\\\u221e\\\": 381, \\\"other\\\": 382, \\\"neighbor\\\": 383, \\\"climbing\\\": 384, \\\"staircase\\\": 385, \\\"step\\\": 386, \\\"steps\\\": 387, \\\"how\\\": 388, \\\"many\\\": 389, \\\"way\\\": 390, \\\"rearranging\\\": 391, \\\"typically\\\": 392, \\\"original\\\": 393, \\\"exactly\\\": 394, \\\"denomination\\\": 395, \\\"total\\\": 396, \\\"fewest\\\": 397, \\\"make\\\": 398, \\\"cannot\\\": 399, \\\"made\\\": 400, \\\"coins\\\": 401, \\\"infinite\\\": 402, \\\"kind\\\": 403, \\\"pair\\\": 404, \\\"parentheses\\\": 405, \\\"generate\\\": 406, \\\"well\\\": 407, \\\"parenthesis\\\": 408, \\\"tree's\\\": 409, \\\"depth\\\": 410, \\\"farthest\\\": 411, \\\"leaf\\\": 412, \\\"revers\\\": 413, \\\"memory\\\": 414, \\\"range\\\": 415, \\\"us\\\": 416, \\\"constant\\\": 417, \\\"inorder\\\": 418, \\\"traversal\\\": 419, \\\"nodes'\\\": 420, \\\"worddict\\\": 421, \\\"segmented\\\": 422, \\\"separated\\\": 423, \\\"reused\\\": 424, \\\"segmentation\\\": 425, \\\"shortest\\\": 426, \\\"increasing\\\": 427, \\\"cell\\\": 428, \\\"directions\\\": 429, \\\"diagonally\\\": 430, \\\"boundary\\\": 431, \\\"wrap\\\": 432, \\\"allowed\\\": 433, \\\"representation\\\": 434, \\\"'1'\\\": 435, \\\"also\\\": 436, \\\"known\\\": 437, \\\"hamming\\\": 438, \\\"weight\\\": 439, \\\"positioned\\\": 440, \\\"array's\\\": 441, \\\"jump\\\": 442, \\\"position\\\": 443, \\\"last\\\": 444, \\\"located\\\": 445, \\\"try\\\": 446, \\\"test\\\": 447, \\\"case\\\": 448, \\\"generated\\\": 449, \\\"le\\\": 450, \\\"109\\\": 451, \\\"subarray\\\": 452, \\\"largest\\\": 453, \\\"suffix\\\": 454, \\\"fit\\\": 455, \\\"algorithm\\\": 456, \\\"run\\\": 457, \\\"division\\\": 458, \\\"operation\\\": 459, \\\"occurrence\\\": 460, \\\"part\\\": 461}\"}}"